import { ADD_ARTICLE } from '../actionTypes';

const initialState = {
  articles: [
    {
      id: 1,
      topic: 'เผยผลวิจัย “สารสกัดขมิ้นชันกับการต้านอาการอักเสบในผู้ป่วยข้อเข่าเสื่อม”',
      desc: 'รองศาสตราจารย์ แพทย์หญิงวิไล คุปต์นิรัติศัยกุล จากคณะแพทยศาสตร์ ศิริราชพยาบาล บรรยายพิเศษ หัวข้อ “Curcumin and its Anti-inflammatory Effect in Knee OA” “สารสกัดขมิ้นชันกับการต้านอาการอักเสบในผู้ป่วยข้อเข่าเสื่อม”...',
      createAt: '2013-05-20',
      picUrl: 'logo-mnrh.jpg'
    },
    {
      id: 2,
      topic: 'ไทยขาดความรู้โภชนาการ อ้วนตายปีละ2หมื่น !!',
      desc: 'ปัญหาโรคอ้วนกับคนไทยมีระดับความรุนแรงเพิ่มขึ้นทุกปี จากข้อมูลล่าสุดของ สำนัก งานกองทุนสนับสนุนการสร้างเสริมสุขภาพ (สสส.) พบจำนวนคนไทยเป็นโรคอ้วนถึงปีละ 4 ล้านคน ติดอันดับ 5 ของภูมิภาคเอเชีย-แปซิฟิก...',
      createAt: '2013-05-08',
      picUrl: 'logo-mnrh.jpg'
    },
    {
      id: 3,
      topic: 'พบไวรัสก่อมะเร็งพื้นที่สาธารณะส้วม-ลิฟต์-บันได',
      desc: 'รพ.รามาฯ สำรวจพบ ไวรัสก่อมะเร็งปากมดลูก องคชาต ทหารหนัก ตามห้องน้ำสาธารณะ ย้ำอย่าตื่น โอกาสติดจากใช้ห้องน้ำยาก แนะล้างมือให้สะอาด...',
      createAt: '2013-06-12',
      picUrl: 'logo-mnrh.jpg'
    }
  ]
};

const articles = (state = initialState, action) => {
  switch (action.type) {
    case ADD_ARTICLE: {
      return {
        ...state
      };
    }
    default:
      return state;
  }
};

export default articles;
